In [30]:
import pandas as pd
import seaborn as  sns

from sklearn.preprocessing import StandardScaler
from sklearn.preprocessing import MinMaxScaler
from sklearn.model_selection import train_test_split

In [31]:
data=sns.load_dataset("titanic")

In [32]:
data

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [33]:
data2=data[['survived','pclass','age','parch']]
data2.head()

   survived  pclass   age  parch
0         0       3  22.0      0
1         1       1  38.0      0
2         1       3  26.0      0
3         1       1  35.0      0
4         0       3  35.0      0

In [34]:
data2=data2.fillna(data2.mean())

In [35]:
x=data2.drop('survived',axis=1)
y=data2["survived"]

In [36]:
print(x.head())
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~')
print(y.head())

   pclass   age  parch
0       3  22.0      0
1       1  38.0      0
2       3  26.0      0
3       1  35.0      0
4       3  35.0      0
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
0    0
1    1
2    1
3    1
4    0
Name: survived, dtype: int64

In [37]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=51)

In [38]:
#feature scale

In [39]:
stdScalar=StandardScaler()
stdScalar.fit(x_train)

StandardScaler()

In [40]:
stdScalar.mean_

array([ 2.30617978, 29.55409121,  0.39185393])

In [41]:
stdScalar.scale_

array([ 0.84405789, 12.99162985,  0.79647463])

In [46]:
x_train_sc=stdScalar.transform(x_train)
x_test_sc=stdScalar.transform(x_test)

In [47]:
x_train_sc

array([[-1.75837972, -2.30776312, -1.1096893 ],
       [-1.75837972, -2.12113234, -1.1096893 ],
       [-1.75837972, -2.38478535, -1.1096893 ],
       ...,
       [-1.75837972, -2.16556824,  3.61939826],
       [-1.75837972, -2.27399706,  0.46667322],
       [-1.75837972, -2.28110158, -1.1096893 ]])